import random

from database.database import (
    create_database,
    save_story
)


def create_story():


    create_database()


    stories = [

{
"title":"අම්මාගේ අවසන් ඉල්ලීම",

"content":
"""
කුඩා ගමක සෙනුර කියන තරුණයෙක් ජීවත් වුණා.

ඔහුගේ අම්මා ගොඩක් දුප්පත් වුණත්
තම පුතාගේ අනාගතය වෙනුවෙන් හැමදේම කැප කළා.

දවසක් සෙනුර නගරයට ගිහින්
ලොකු රැකියාවක් කරන්න තීරණය කළා.

අම්මා ඔහුට කිව්වා,
පුතා සාර්ථක වෙන්න,
නමුත් කවදාවත් මනුස්සකම අමතක කරන්න එපා කියලා.

වසර ගණනාවකට පසු සෙනුර විශාල ව්‍යාපාරිකයෙක් වුණා.

නමුත් ඔහුට අම්මා මතක් වුණා.

ඔහු නැවත ගමට පැමිණියා.

අම්මා තවමත් ඔහු එනතුරු බලා සිටියා.

සෙනුර අම්මාගේ පාමුල වැඳ වැටී
ඔබේ ආදරය නිසා තමයි මම අද මෙතන ඉන්නේ කියලා කිව්වා.

එදා ඔහු තේරුම් ගත්තා,
ජීවිතයේ ලොකුම වටිනාකම මුදල් නොව
ආදරය බව.
"""
},


{
"title":"පරණ නිවසේ රහස",

"content":
"""
ගමේ කෙළවරේ තිබුණු පරණ නිවසක් ගැන
හැමෝම අමුතු කතා කිව්වා.

කිසිවෙකුත් රාත්‍රියේ එම නිවසට යන්න කැමති වුණේ නැහැ.

එක් දිනක කවිඳු කියන තරුණයා
එහි ඇත්ත දැනගන්න තීරණය කළා.

ඔහු රාත්‍රියේ නිවසට ඇතුළු වුණා.

එහි තිබුණේ පැරණි පොත් සහ
පවුලක අමතක වූ මතකයන්.

භයානක දෙයක් නොව,
වසර ගණනාවක් සඟවා තිබූ ආදරණීය කතාවක්.

කවිඳු ඒ රහස ගමට හෙළි කළා.

එදා සිට පරණ නිවස
භීතියේ තැනක් නොව
මතකයන්ගේ තැනක් වුණා.
"""
}

]


    story=random.choice(stories)


    save_story(
        story["title"],
        story["content"]
    )


    return story
